Revit 2027 API
PathOfTravel.UpdateMultiple(Document, IList<ElementId>, IList<PathOfTravelCalculationStatus>) Method
 Updates the specified paths of travel by recalculating each path using their original start and end points and provides creation result statuses.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static int UpdateMultiple(
	Document adoc,
	IList<ElementId> elementsToUpdate,
	out IList<PathOfTravelCalculationStatus> resultStatus
)
Public Shared Function UpdateMultiple (
	adoc As Document,
	elementsToUpdate As IList(Of ElementId),
	<OutAttribute> ByRef resultStatus As IList(Of PathOfTravelCalculationStatus)
) As Integer
public:
static int UpdateMultiple(
	Document^ adoc,
	IList<ElementId^>^ elementsToUpdate,
	[OutAttribute] IList<PathOfTravelCalculationStatus>^% resultStatus
)
static member UpdateMultiple :
        adoc : Document *
        elementsToUpdate : IList<ElementId> *
        resultStatus : IList<PathOfTravelCalculationStatus> byref -> int
Parameters
adoc Document
 Document of elements to be updated.
elementsToUpdate IList<ElementId>
 The list of ElementIdof the paths to update.
resultStatus IList<PathOfTravelCalculationStatus>
 Result statuses of each path of travel creation. The order of statuses corresponds to the order of elements in the array passed to the function.
Return Value
Int32
 number of successfully updated elements
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  This functionality is not available in Revit LT.
Remarks
 For unsuccessfully updated elements, Revit will post warnings.
See Also
Reference
PathOfTravel Class
UpdateMultiple Overload
Autodesk.Revit.DB.Analysis Namespace